In [1]:
import pandas as pd

In [8]:
# Pandas Series
my_series = pd.Series([10,30,-6,9])

In [9]:
my_series

0    10
1    30
2    -6
3     9
dtype: int64

In [12]:
print(my_series.index) # returns index
print(my_series.values) # returns values

RangeIndex(start=0, stop=4, step=1)
[10 30 -6  9]

In [15]:
my_series2 = pd.Series([10,30,6,9],index=['Bill','Denise','John','Cassandra'])
my_series2

Bill         10
Denise       30
John          6
Cassandra     9
dtype: int64

In [18]:
print(my_series2[1])
print(my_series2['Denise'])

30
30

In [20]:
population_dict = {
    'California' : 38000,
    'Texas' : 26400,
    'New York': 196000,
    'Florida' : 19000
}

In [24]:
population = pd.Series(population_dict)
print(population)

California     38000
Texas          26400
New York      196000
Florida        19000
dtype: int64

In [28]:
population.mean()

69850.0

In [29]:
import numpy as np
np.mean(population) # numpy can take a pandas object!!

69850.0

In [31]:
#mean(population) # this would run in R, not in Python

In [32]:
# create a dict of lists
my_dict = {
    'name':['Bella','Charlie','Lucy'],
    'breed':['Labrador','Poodle','ChowChow'],
    'color':['Brown','Black','Brown'],
    'weight':[24,24,17]
}

In [33]:
my_dict

{'name': ['Bella', 'Charlie', 'Lucy'],
 'breed': ['Labrador', 'Poodle', 'ChowChow'],
 'color': ['Brown', 'Black', 'Brown'],
 'weight': [24, 24, 17]}

In [34]:
df = pd.DataFrame(my_dict)
print(df)

      name     breed  color  weight
0    Bella  Labrador  Brown      24
1  Charlie    Poodle  Black      24
2     Lucy  ChowChow  Brown      17

In [35]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [36]:
df.columns

Index(['name', 'breed', 'color', 'weight'], dtype='object')

In [37]:
df.values

array([['Bella', 'Labrador', 'Brown', 24],
       ['Charlie', 'Poodle', 'Black', 24],
       ['Lucy', 'ChowChow', 'Brown', 17]], dtype=object)

In [13]:
import pandas as pd
# pd.set_option('display.max_rows', 10) default is 10, you can change it to n > number of rows

# read_csv() function to read in csv files in pandas
#df = pd.read_csv(r'C:\Users\bilene\Downloads\gapminder.csv')
df = pd.read_csv(r'https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/gapminder.csv')

#airmen = pd.read_csv(r'https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2022/2022-02-08/airmen.csv')
#airmen

df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [14]:
df.shape

(1704, 6)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [16]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [94]:
dogs = pd.read_csv(r'https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/dogs.csv')
dogs

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [20]:
#dogs.name # access by name

In [21]:
#dogs['name'] # access by name (most flexible)

In [28]:
#dogs.loc[:,'name'] # access by name (similar to list syntax)

In [27]:
#dogs.iloc[:,0] # access by index (similar to list syntax)

In [29]:
#dogs[['height_cm','breed']] # get columns height_cm, breed

In [35]:
#dogs.iloc[0:2,] # get first two rows, using iloc

In [36]:
#dogs[:2] # get first two rows, using index approach

In [43]:
#dogs[dogs.height_cm > 50] # get rows where height_cm>50

In [44]:
#dogs.loc[dogs.height_cm>50] # get rows where height_cm>50

In [58]:
#dogs[dogs.breed=='Labrador'] get rows where breed is Labrador
#dogs[dogs['breed'] == 'Labrador']

In [57]:
#dogs[dogs.date_of_birth > "2015-01-01"] # birthday > Jan 1, 2015

In [59]:
dogs

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [69]:
#dogs[(dogs['breed'] == 'Labrador') & (dogs.date_of_birth > "2015-01-01")] # two conditions at the same time, breed == Labrador and birthday > Jan 1, 2015
                                                # can't use 'and'
                                                # have to use parantheses around each condition

In [70]:
#dogs[dogs.color.isin(['Black','Brown'])] # .isin() function to subset based on multiple categories in a list

In [73]:
#dogs.loc[1:3,'breed']  # get row index 1,2,3 and column breed
#dogs.breed.iloc[1:4]

1       Poodle
2     ChowChow
3    Schnauzer
Name: breed, dtype: object

In [86]:
#dogs.iloc[1:4]['breed']

In [87]:
#dogs.iloc[1:4]['breed'] # .breed works too!

In [97]:
dogs['height_m'] = dogs.height_cm/100  # convert height (in cm) to height in meters. Create a new column called height_m.

In [98]:
dogs

      name       breed  color  height_cm  weight_kg date_of_birth  height_m
0    Bella    Labrador  Brown         56         24    2013-07-01      0.56
1  Charlie      Poodle  Black         43         24    2016-09-16      0.43
2     Lucy    ChowChow  Brown         46         24    2014-08-25      0.46
3  Coooper   Schnauzer   Gray         49         17    2011-12-11      0.49
4      Max    Labrador  Black         59         29    2017-01-28      0.59
5   Stella   Chihuahua    Tan         18          2    2015-04-20      0.18
6   Bernie  St.Bernard  White         77         74    2018-02-27      0.77

In [101]:
dogs['bmi'] = dogs.weight_kg / dogs.height_m**2 # create bmi = weight / height^2 * note the double stars for power
dogs

,name,breed,color,height_cm,weight_kg,date_of_birth,height_m,bmi
0,Bella,Labrador,Brown,56,24,2013-07-01,0.56,76.530612
1,Charlie,Poodle,Black,43,24,2016-09-16,0.43,129.799892
2,Lucy,ChowChow,Brown,46,24,2014-08-25,0.46,113.421550
3,Coooper,Schnauzer,Gray,49,17,2011-12-11,0.49,70.803832
4,Max,Labrador,Black,59,29,2017-01-28,0.59,83.309394
5,Stella,Chihuahua,Tan,18,2,2015-04-20,0.18,61.728395
6,Bernie,St.Bernard,White,77,74,2018-02-27,0.77,124.810255

In [2]:
###################################################
# Advanced Operations in Pandas
import pandas as pd
dogs = pd.read_csv(r'https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/dogs.csv')
dogs

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [3]:
dogs.info() #info about variables

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7 non-null      object
 1   breed          7 non-null      object
 2   color          7 non-null      object
 3   height_cm      7 non-null      int64
 4   weight_kg      7 non-null      int64
 5   date_of_birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [4]:
dogs.describe() # statistical summaries of variables

       height_cm  weight_kg
count   7.000000   7.000000
mean   49.714286  27.714286
std    17.960274  22.216468
min    18.000000   2.000000
25%    44.500000  20.500000
50%    49.000000  24.000000
75%    57.500000  26.500000
max    77.000000  74.000000

In [5]:
# unique() and value_count()
dogs.color.unique() # handy for categorical variables

array(['Brown', 'Black', 'Gray', 'Tan', 'White'], dtype=object)

In [7]:
dogs.color.value_counts()

Black    2
Brown    2
Gray     1
Tan      1
White    1
Name: color, dtype: int64

In [11]:
dogs.color.value_counts(normalize=True)

Black    0.285714
Brown    0.285714
Gray     0.142857
Tan      0.142857
White    0.142857
Name: color, dtype: float64

In [12]:
# mean of height_cm, using mean()
dogs.height_cm.mean()
# other funcs you can use: median() sum() count() nunique() min() max()

49.714285714285715

In [15]:
# alternatively,
import numpy as np
np.mean(dogs.height_cm)

49.714285714285715

In [17]:
# Aggregating data
indicators = pd.read_csv('https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/indicators.csv')
indicators.head()

  code        country      pop       gdp   life     cell
0  CAN         Canada    36.26   1535.77  82.30    30.75
1  CHN          China  1378.66  11199.15  76.25  1364.93
2  IND          India  1324.17   2263.79  68.56  1127.81
3  RUS         Russia   144.34   1283.16  71.59   229.13
4  USA  United States   323.13  18624.47  78.69   395.88

In [18]:
indicators.agg({'life':['min','median'], 'cell':'median'})

         life     cell
min     68.56      NaN
median  76.25  312.505

In [19]:
# groupby
topnames = pd.read_csv('https://raw.githubusercontent.com/ernbilen/Data200_Fall22/main/data/topnames.csv')
topnames.head()

   year     sex  name  count
0  1880  Female  Mary   7065
1  1880    Male  John   9655
2  1881  Female  Mary   6919
3  1881    Male  John   8769
4  1882  Female  Mary   8148

In [20]:
topnames

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [32]:
print(topnames[topnames['sex']=='Female']['count'].mean())
print(topnames[topnames['sex']=='Male']['count'].mean())
# two lines, not good!

42372.676258992804
47597.81294964029

In [35]:
topnames.groupby('sex').mean()

          year         count
sex
Female  1949.0  42372.676259
Male    1949.0  47597.812950

In [39]:
# sorting data, using sort_values()
dogs.sort_values('weight_kg',ascending=False)

      name       breed  color  height_cm  weight_kg date_of_birth
6   Bernie  St.Bernard  White         77         74    2018-02-27
4      Max    Labrador  Black         59         29    2017-01-28
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
5   Stella   Chihuahua    Tan         18          2    2015-04-20

In [40]:
dogs.sort_values(['weight_kg','height_cm'], ascending=[False,True])

      name       breed  color  height_cm  weight_kg date_of_birth
6   Bernie  St.Bernard  White         77         74    2018-02-27
4      Max    Labrador  Black         59         29    2017-01-28
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
0    Bella    Labrador  Brown         56         24    2013-07-01
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
5   Stella   Chihuahua    Tan         18          2    2015-04-20

In [44]:
# Delete cols and rows

# create a copy dataframe, called ind2
ind2 = indicators
print(ind2)

# a better way:
ind2 = indicators.copy()
print(ind2)

  code        country      pop       gdp   life     cell
0  CAN         Canada    36.26   1535.77  82.30    30.75
1  CHN          China  1378.66  11199.15  76.25  1364.93
2  IND          India  1324.17   2263.79  68.56  1127.81
3  RUS         Russia   144.34   1283.16  71.59   229.13
4  USA  United States   323.13  18624.47  78.69   395.88
5  VNM        Vietnam    94.59    205.28  76.25   120.60
  code        country      pop       gdp   life     cell
0  CAN         Canada    36.26   1535.77  82.30    30.75
1  CHN          China  1378.66  11199.15  76.25  1364.93
2  IND          India  1324.17   2263.79  68.56  1127.81
3  RUS         Russia   144.34   1283.16  71.59   229.13
4  USA  United States   323.13  18624.47  78.69   395.88
5  VNM        Vietnam    94.59    205.28  76.25   120.60

In [45]:
# remove the cell column, using del
del ind2['cell']
print(ind2)

  code        country      pop       gdp   life
0  CAN         Canada    36.26   1535.77  82.30
1  CHN          China  1378.66  11199.15  76.25
2  IND          India  1324.17   2263.79  68.56
3  RUS         Russia   144.34   1283.16  71.59
4  USA  United States   323.13  18624.47  78.69
5  VNM        Vietnam    94.59    205.28  76.25

In [49]:
# another way is to pop() deletes the cell column, simultaneously returns the deleted column
ind2 = indicators.copy()
cell =  ind2.pop('cell')

In [50]:
ind2

  code        country      pop       gdp   life
0  CAN         Canada    36.26   1535.77  82.30
1  CHN          China  1378.66  11199.15  76.25
2  IND          India  1324.17   2263.79  68.56
3  RUS         Russia   144.34   1283.16  71.59
4  USA  United States   323.13  18624.47  78.69
5  VNM        Vietnam    94.59    205.28  76.25

In [54]:
# using drop() method
ind2 = indicators.copy()
ind2 = ind2.drop(['cell','life'],axis=1) # don't forget to save the df output after!
ind2

  code        country      pop       gdp
0  CAN         Canada    36.26   1535.77
1  CHN          China  1378.66  11199.15
2  IND          India  1324.17   2263.79
3  RUS         Russia   144.34   1283.16
4  USA  United States   323.13  18624.47
5  VNM        Vietnam    94.59    205.28

In [66]:
# delete by row
ind2 = indicators.copy()

# make code column index
ind2.index = ind2['code']
ind2 = ind2.drop('code',axis=1)
print(ind2)

ind2 = ind2.drop(['USA','RUS'],axis=0) # don't forget to save the df after!

            country      pop       gdp   life     cell
code
CAN          Canada    36.26   1535.77  82.30    30.75
CHN           China  1378.66  11199.15  76.25  1364.93
IND           India  1324.17   2263.79  68.56  1127.81
RUS          Russia   144.34   1283.16  71.59   229.13
USA   United States   323.13  18624.47  78.69   395.88
VNM         Vietnam    94.59    205.28  76.25   120.60

      country      pop       gdp   life     cell
code
CAN    Canada    36.26   1535.77  82.30    30.75
CHN     China  1378.66  11199.15  76.25  1364.93
IND     India  1324.17   2263.79  68.56  1127.81
VNM   Vietnam    94.59    205.28  76.25   120.60

In [67]:
ind2 = indicators.copy()
# create a column called gdp_yen
ind2['gdp_yen'] = ind2['gdp'] * 144.41
ind2

  code        country      pop       gdp   life     cell       gdp_yen
0  CAN         Canada    36.26   1535.77  82.30    30.75  2.217805e+05
1  CHN          China  1378.66  11199.15  76.25  1364.93  1.617269e+06
2  IND          India  1324.17   2263.79  68.56  1127.81  3.269139e+05
3  RUS         Russia   144.34   1283.16  71.59   229.13  1.853011e+05
4  USA  United States   323.13  18624.47  78.69   395.88  2.689560e+06
5  VNM        Vietnam    94.59    205.28  76.25   120.60  2.964448e+04

In [68]:
# create a new column called country_caps using lambda and upper()
'Canada'.upper()

'CANADA'

In [71]:
# create a custom 1-line function
to_caps = lambda s: s.upper()

In [73]:
# use the apply() function to implement custom made to_caps
ind2['country'].apply(to_caps)

0           CANADA
1            CHINA
2            INDIA
3           RUSSIA
4    UNITED STATES
5          VIETNAM
Name: country, dtype: object

In [77]:
# update a column
ind2 = indicators.copy()
print(ind2)
print('\n')
# add +1 to all values in life column
ind2['life'] = ind2['life'] + 1
print(ind2)

  code        country      pop       gdp   life     cell
0  CAN         Canada    36.26   1535.77  82.30    30.75
1  CHN          China  1378.66  11199.15  76.25  1364.93
2  IND          India  1324.17   2263.79  68.56  1127.81
3  RUS         Russia   144.34   1283.16  71.59   229.13
4  USA  United States   323.13  18624.47  78.69   395.88
5  VNM        Vietnam    94.59    205.28  76.25   120.60


  code        country      pop       gdp   life     cell
0  CAN         Canada    36.26   1535.77  83.30    30.75
1  CHN          China  1378.66  11199.15  77.25  1364.93
2  IND          India  1324.17   2263.79  69.56  1127.81
3  RUS         Russia   144.34   1283.16  72.59   229.13
4  USA  United States   323.13  18624.47  79.69   395.88
5  VNM        Vietnam    94.59    205.28  77.25   120.60

            country      pop       gdp   life     cell
code
CAN          Canada    36.26   1535.77  82.30    30.75
CHN           China  1378.66  11199.15  76.25  1364.93
IND           India  1324.17   2263.79  68.56  1127.81
RUS          Russia   144.34   1283.16  71.59   229.13
USA   United States   323.13  18624.47  78.69   395.88
VNM         Vietnam    94.59    205.28  76.25   120.60